HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_OFF (16u)

/** \brief Length for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_LEN (14u)

/** \brief Mask for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_MSK (0x3fffu)

/** \brief Offset for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_OFF (0u)

/** \brief Length for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_LEN (11u)

/** \brief Mask for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_OFF (16u)

/** \brief Length for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_LEN (2u)

/** \brief Mask for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_OFF (0u)

/** \brief Length for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_LEN (2u)

/** \brief Mask for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_OFF (8u)

/** \brief Length for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_LEN (3u)

/** \brief Mask for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_OFF (16u)

/** \brief Length for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_LEN (3u)

/** \brief Mask for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_OFF (24u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_LEN (6u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_OFF (0u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_LEN (1u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_OFF (6u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_LEN (1u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_OFF (7u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_LEN (2u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_OFF (8u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_LEN (1u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_OFF (12u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_LEN (1u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_OFF (13u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_LEN (1u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_OFF (14u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_LEN (3u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_OFF (16u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_LEN (5u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_MSK (0x1fu)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_OFF (19u)

/** \brief Length for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_LEN (6u)

/** \brief Mask for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_OFF (24u)

/** \brief Length for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_LEN (4u)

/** \brief Mask for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_OFF (0u)

/** \brief Length for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_LEN (2u)

/** \brief Mask for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_OFF (6u)

/** \brief Length for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_LEN (5u)

/** \brief Mask for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_MSK (0x1fu)

/** \brief Offset for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_OFF (8u)

/** \brief Length for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_LEN (11u)

/** \brief Mask for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_OFF (0u)

/** \brief Length for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_LEN (11u)

/** \brief Mask for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_OFF (16u)

/** \brief Length for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_LEN (14u)

/** \brief Mask for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_MSK (0x3fffu)

/** \brief Offset for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_OFF (0u)

/** \brief Length for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_LEN (6u)

/** \brief Mask for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_OFF (16u)

/** \brief Length for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_LEN (12u)

/** \brief Mask for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_MSK (0xfffu)

