HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_OFF (25u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_OFF (26u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_OFF (27u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_OFF (28u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_OFF (29u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_OFF (30u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_OFF (31u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_OFF (0u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_OFF (1u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_OFF (2u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_OFF (3u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_OFF (4u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_OFF (5u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_OFF (6u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_OFF (7u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_OFF (8u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_OFF (9u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_OFF (10u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_OFF (11u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_OFF (12u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_OFF (13u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_OFF (14u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_OFF (15u)

/** \brief Length for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_LEN (1u)

