HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_OFF (29u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_OFF (30u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_OFF (31u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_OFF (0u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_OFF (1u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_OFF (2u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_OFF (3u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_OFF (4u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_OFF (5u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_OFF (6u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_OFF (7u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_OFF (8u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_OFF (9u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_OFF (10u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_OFF (11u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_OFF (12u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_OFF (13u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_OFF (14u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_OFF (15u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_OFF (16u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_OFF (17u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_OFF (18u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_OFF (19u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_LEN (1u)

